index=* EventCode=4624
| eval fake_time=_time - 46800
| eval readable_time=strftime(fake_time, "%Y-%m-%d %H:%M:%S")
| eval hour=tonumber(strftime(fake_time, "%H"))
| eval is_admin=if(match(Account_Name, "Administrator|support1|admin"), 1, 0)
| where hour < 9 OR hour >= 19
| where is_admin=1
| table readable_time, Account_Name, Source_Network_Address, host, hour