index=* EventCode=1
| eval cmd=lower(CommandLine)
| where like(cmd, "%wevtutil%") OR like(cmd, "%clear-eventlog%") OR like(cmd, "%remove-eventlog%")
| table _time, host, ParentImage, Image, CommandLine, User
| sort -_time